[
  {
    "chapter": "cell structure",
    "chunk_id": 1,
    "content": "CELL STRUCTURE AND FUNCTIONS INTRODUCTION Cell theory is fundamental to biology. By the middle of the 19th century, biologists had formulated cell theory. The generally accepted portions of the modern cell theory are as follows: 1) The cell is the fundamental unit of structure and function in living things. 2) All organisms are made up of one or more cells. 3) Cells arise from other cells through cellular division. This chapter will help you become familiar with the structure of cells and how they function, as well as the basic techniques essential for cell study. 1.1 TECHNIQUES USED IN CELL BIOLOGY To understand the structure and functions of cells and cell organelles, some techniques will be discussed here briefly. 1.1.1 Cell Fractionation Cell fractionation is the combination of various methods used to separate cell organelles and components based upon size and density. It is very useful for electron microscopy of cell components. The principle of cell fractionation consists of two steps: homogenization and centrifugation. Homogenization It is the formation of a homogeneous mass of cells. It involves the grinding of cells in a suitable medium with correct pH, ionic composition and temperature. In plants, enzyme pectinase is added to digest"
  },
  {
    "chapter": "cell structure",
    "chunk_id": 2,
    "content": "middle lamella. This can be done in a blender. This procedure gives rise to a uniform mixture of cells which is then centrifuged. Centrifugation Centrifugation is the process to separate substances on the basis of their size and densities under the influence of centrifugal force. It is done by a machine called centrifuge. This machine can spin the tubes at very high speed. Spinning the tubes exerts a centrifugal force on the contents. There are two major ways of centrifugation: density gradient centrifugation and differential centrifugation. In density gradient centrifugation, the cell components of different sizes and densities are separated in different layers. The upper layers are less dense than lower layers. In differential centrifugation, the size and shape of particles determines how fast it settles. A series of increasing speeds can be used. At each step, the content which settles in the bottom of the tube are called pellet and those that remain suspended above in the form of liquid are called supernatant. After each speed, the supernatant can be drawn off and centrifuged again. A series of pellets containing cell organelles of smaller and smaller size can therefore be obtained. 1.1.2 Staining Techniques Most biological structures are transparent."
  },
  {
    "chapter": "cell structure",
    "chunk_id": 3,
    "content": "In order to differentiate between these structures, various dyes are applied. Such techniques are called staining techniques. When only one stain, such as basic carmine (that stains nucleus) is used, it is called simple staining. When two stains - one that will stain nucleus (e.g., hematoxylin) and another that will stain cytoplasm (e.g., eosin) are used - the process is called double staining or differential staining. 1.1.3 Microdissection Microdissection refers to the variety of techniques where a microscope is used to assist in removing tumors or granules from delicate tissue or cells like brain, heart cells. In this technique, the image is seen on large TV screen or monitor while dissecting. 1.1.4 Tissue Culture Tissue culture is the growing of a cell or a tissue on chemically defined nutrient medium under sterile conditions. This technique can be employed for both plants and animals. Plant tissue culturing is mainly used for plant cloning i.e., production of genetically identical plants. Animal tissue culture is usually set up by growing individual cells on the surface of a glass container. Animal tissue cultures are used to study diseases of the cell, e.g., cancer, chromosomal disorders etc. 1.1.5 Chromatography Chromatography is a technique which is"
  },
  {
    "chapter": "cell structure",
    "chunk_id": 4,
    "content": "used to separate different chemical compounds from a mixture. It is generally used for the separation of mixtures of proteins, amino acids or photosynthetic pigments. There are different types of chromatographic techniques. Paper chromatography is a simple and widely used technique. It involves two phases. 1.1.6 Gel Electrophoresis Gel electrophoresis is a technique which is used to separate DNA bearing polymer molecules on the basis of size, shape, molecular weight and charge whether (+) or (-). This technique utilizes a gel medium for separation of fragments which is done under the influence of an electric field. Often the gel is sandwiched between glass or plastic plates to form a viscous slab. The two ends of the slabs are embedded in two salt solutions that are connected through electrodes to a power source. At one end of the gel, the samples are loaded. When voltage is applied to the apparatus, the molecules present in the gel migrate through the electric field. The negatively charged molecule will move towards the positive pole and the molecule having positive charge will move towards the negative pole. The velocity of movement of fragments is inversely proportional to the size. Therefore smaller fragments move faster than"
  },
  {
    "chapter": "cell structure",
    "chunk_id": 5,
    "content": "larger ones. In this way all the fragments are separated in the gel after some time. Later on the molecules can be pinpointed by staining the gel. 1.1.7 Spectrophotometry Spectrophotometry is a technique which is used to determine the absorption of different wavelengths of light by a particular chemical compound or a photosynthetic pigment. For this purpose the instrument used is spectrophotometer. The amount of light absorbed at each wavelength is plotted in a graph called the absorption spectrum. 1.1.8 Resolution and Magnification in Microscopy The minimum capacity of a lens to differentiate between two adjacent points is called resolution. The resolution of naked eye is 0.1 mm. This resolution can be increased by increasing magnification. The magnification is the capacity of an optical instrument to increase the size of an object than its original size. The objects which cannot be seen by naked eye can also be observed by increasing magnification. Different lenses have different magnification powers which are represented by letter \"X\" that means the number of times the original size. Therefore, a lens of 10X magnification power can increase the size of an object from 1 μm to 10 μm. Light microscopy is the technique used to"
  },
  {
    "chapter": "cell structure",
    "chunk_id": 6,
    "content": "view objects that cannot be seen by naked eye. Most animal and plant cells are between 1 μm and 100 μm. Magnification power of a compound microscope is equal to the product of magnification powers of both lenses. The resolving power of light microscope is 250 nm and its magnification is up to 4000X. The resolving power of electron microscope is 0.2 nm and its magnification is up to 2,000,000X. 1.1.9 Micrometry Micrometry is the measurement of the size of objects under microscope. It involves use of two micrometers. The ocular micrometer is a disc (plastic or glass) with 100 equal divisions with no absolute value. It is placed in the eyepiece of the microscope. Then it is calibrated by using a stage micrometer. This is a glass slide with an exact scale like a miniature transparent ruler. By superimposing the images of the ocular micrometer and stage micrometer scales, it is calibrated so the size of any given object viewed under the microscope can be estimated. 1.2 CELL WALL AND PLASMA MEMBRANE The plasma membrane is the outer living boundary of the cell. Many cells have an extracellular component that is formed exterior to the membrane, which is called"
  },
  {
    "chapter": "cell structure",
    "chunk_id": 7,
    "content": "cell wall. 1.2.1 Cell Wall The cell wall is present in plant cells, prokaryotes and fungi but animal cells do not have cell wall. This is probably due to their locomotory mode of life. Plant cell walls (made up of cellulose) differ in chemical composition from those of the prokaryotes (made up of peptidoglycan) and fungi (made up of chitin). We will discuss here only plant cell wall. The cell wall is secreted by the cell. The cell wall is porous and allows free passage of water and dissolved material. The plant cell wall consists of three main layers: primary cell wall, middle lamella and secondary cell wall. Primary Cell Wall Primary cell wall is a true wall and develops in newly growing cell i.e., during cell growth. Each cell produces a primary cell wall. The primary cell wall is present inner to the middle lamella. The primary cell wall is thin and slightly flexible. The primary cell wall is made of cellulose microfibrils (bundles of cellulose chains), running through the matrix of pectic substances. Middle Lamella Middle lamella is present between the primary cell walls of adjacent cells. The middle lamella is mainly composed of pectic substances. It acts"
  },
  {
    "chapter": "cell structure",
    "chunk_id": 8,
    "content": "as cementing layer and binds the primary cell walls together. Secondary Cell Wall Secondary cell wall is formed between the primary cell wall and plasma membrane only in cells that have reached maximum growth because it is very thick and rigid. It does not allow further growth. The secondary cell wall consists of cellulose, hemicellulose, lignin, inorganic salts and waxes. Its cellulose microfibrils are also cemented together and anchored by lignin. Secondary cell wall provides definite shape to the cell. 1.2.2 Plasma Membrane Fluid Mosaic Model of Plasma Membrane The model proposes that the membrane consists of protein-phospholipid bilayer in which protein molecules are either partially or wholly embedded. These proteins are scattered throughout the membrane in an irregular pattern just like large icebergs floating in the sea. The pattern of distribution of proteins can vary from membrane to membrane and also vary on both surfaces of membrane. The membrane is about 7 nm thick. The lipid part of plasma membrane consists of two layers (bilayer) of phospholipids which are arranged in such a way that their hydrophobic ends face each other while hydrophilic ends are appeared on the surface. The steroids, cholesterols are wedged into the phospholipid bilayer at"
  },
  {
    "chapter": "cell structure",
    "chunk_id": 9,
    "content": "some intervals. The plasma membrane is asymmetrical i.e., their two halves are not identical. In general most membrane proteins drift sideways in the fluid bilayer. The proteins within a membrane determine most of the functions. Carbohydrates are either attached to proteins (glycoproteins) or lipids (glycolipids) generally on the outer side of membrane. Filaments of the cytoskeleton are also present on the inner surface of the membrane. These support the plasma membrane. Functions of Plasma Membrane Lipids The lipid part of plasma membrane controls the fluidity of the membrane. When the unsaturated fatty acid in phospholipids becomes greater, the bilayer becomes more fluid. This makes cell membrane more flexible. The cholesterol helps to stabilize the lipid bilayer and restricts entry and exit of polar molecules and ions. Functions of Plasma Membrane Proteins Various types of proteins are found in plasma membrane which may function as channels, carriers, receptors or as antigens. Transport: Some proteins help molecules to move across the membrane, others are carriers that help it to move across the membrane. Enzymatic Functions: Some plasma membrane proteins have enzymatic functions e.g., adenyl cyclase converts ATP to cyclic AMP (cAMP). Receptors: Some proteins in the plasma membrane are receptors that recognize"
  },
  {
    "chapter": "cell structure",
    "chunk_id": 10,
    "content": "signal molecules from other cells. Each type of receptor has a specific shape. The binding of signal molecule to receptor can bring about an intracellular response. For example, hormones travel in blood, but bind to specific target cells, with specific receptors. Antigens: Some proteins are antigens which enable the cells to recognize other cells as self or non-self. Foreign antigens can be recognized and attacked by immune system. Roles of Glycolipids and Glycoproteins Mostly glycolipids and glycoproteins act as cell surface markers. They are involved in cell recognition and sticking the correct cells together in tissues. Regulation of Cell's Interaction Plasma membrane regulates cell's interaction with its environment by controlling transport of material across the cell. Transport across plasma membrane occurs to: (1) obtain nutrients (2) excrete waste substances (3) secrete useful substances (4) generate ionic gradients essential for nervous and muscular activity (5) maintain a suitable pH and ionic concentration within the cell for enzyme activity. 1.3 CYTOPLASM The part of the cell between the nucleus and plasma membrane is called cytoplasm. In eukaryotic cells it can be divided into two components: cytosol and cell organelles. 1.3.1 Cytosol Cytosol is the solution component of cytoplasm and forms a component"
  },
  {
    "chapter": "cell structure",
    "chunk_id": 11,
    "content": "of both prokaryotic and eukaryotic cells. The major difference between these two kinds of cells is the presence or absence of membrane-bound organelles. These structures are absent in prokaryotic cells. The cytosol forms a solution that contains all the dissolved materials. There are ions and small molecules in true solution and large organic molecules. Metabolic and Storage Role of Cytoplasm The cytoplasm acts as a site of metabolism and storehouse of a cell. The metabolic pathways generally occur in the cytosol which includes protein synthesis, glycolysis etc. The cytosol is usually concerned with storage of useful compounds which are subsequently used in various cellular activities and waste compounds which are eliminated from the cell time to time. 1.3.2 Cell Organelles In a eukaryotic cell, the cytoplasm contains highly organized discrete structures which are specific for various cellular functions are called cell organelles. The cell organelles are generally enclosed by membrane except few such as ribosome. The organelles in the cytoplasmic matrix of a cell are: endoplasmic reticulum, ribosomes, Golgi complex, lysosomes, peroxisomes, glyoxysomes, vacuoles, mitochondria, and chloroplasts etc. Endoplasmic Reticulum An interconnecting network of cisternae (elongated closed sacs) which is generally extended from nuclear membrane to the plasma membrane throughout"
  },
  {
    "chapter": "cell structure",
    "chunk_id": 12,
    "content": "the cytoplasm of all eukaryotic cells is called endoplasmic reticulum (ER). There are two types of ER, rough ER and smooth ER. Most cells contain both types of ER. However, some cells (skeletal muscle cells) have smooth ER more, where these are called sarcoplasmic reticulum. Rough ER has ribosomes attached to the sides facing the cytoplasm and has rough appearance under electron microscope. Rough ER is mainly concerned with protein synthesis (translation) due to the association of ribosomes; however, the presence of ER in the cell also provides mechanical support to the cell. Smooth ER is continuous with the RER. Since ribosomes are not attached to it, therefore, it has smooth appearance under electron microscope. The smooth ER functions in various metabolic processes, e.g., metabolism of carbohydrates. The detoxification of drugs especially in the liver cells and synthesis of lipids including oils, phospholipids and steroids take place in smooth ER. It also stores calcium ions, when released calcium ions trigger contraction of the muscle. Smooth ER also transports various cellular products within the cell e.g., proteins from rough ER are also transported to the Golgi complex through smooth ER. Like rough ER, the presence smooth ER in the cell also"
  },
  {
    "chapter": "cell structure",
    "chunk_id": 13,
    "content": "provides mechanical support. Ribosomes Ribosomes can be seen only under electron microscope as non-membranous bodies scattered throughout the cytoplasm in eukaryotic as well as prokaryotic cells. However, eukaryotic ribosomes are larger and characterized as 80S ribosomes while the prokaryotic ribosomes are smaller and are characterized as 70S ribosomes. Ribosomes are made up of ribosomal RNA and protein so they are ribonucleoprotein. These are transported to the cytoplasm through the nuclear pore. In eukaryotic cell, the ribosomes may be found as attached with RER or free in cytoplasm. Ribosomes are also found in matrix of mitochondria and stroma of chloroplasts. These ribosomes are prokaryotic (70S) in nature. The eukaryotic ribosomes are composed of two subunits of different sizes, the larger one is 60S particles and the smaller one is 40S particles. The two subunits on attachment form 80S particles. The attachment is controlled by presence of magnesium ions by forming salt bonds between phosphate group of RNA and amino group of protein. The two subunits are generally attached together at the time of their function during the events of protein synthesis. Sometimes, during protein synthesis several ribosomes get attached to one mRNA molecule. Such a chain of ribosomes is called polyribosomes."
  },
  {
    "chapter": "cell structure",
    "chunk_id": 14,
    "content": "In this way several copies of same protein can be formed in very less time. Golgi Complex It is found in all eukaryotic cells. It was discovered by Italian biologist Camillo Golgi. Golgi complex consists of a stack of flattened membrane-bound sacs. The forming face (cis face) is convex, while the inner end is concave and is called maturing face (trans face). The most important function of Golgi complex is the processing of cell secretions. Therefore these organelles are abundant in secretory cells. The cell secretions mainly consist of proteins. Golgi complex collects these proteins from RER through SER, modifies them to perform specific function and then exports these modified products in the form of vesicle. Certain organelles, such as lysosomes, peroxisomes and glyoxysomes also originate from Golgi complex. Golgi complex is also involved in the formation of conjugated molecules like glycoprotein, lipoprotein etc. In plant cell during cell division, Golgi complex gives rise to vesicles that contain cell wall synthesizing materials. At cytokinesis, these Golgi vesicles are arranged on the cell equator, fuse together and form a structure, called phragmoplast. Later on new cell wall is derived from this structure. Lysosomes Lyso means splitting and soma means body. These"
  },
  {
    "chapter": "cell structure",
    "chunk_id": 15,
    "content": "are single membranous, spherical vesicles. They contain digestive or hydrolytic enzymes. The lysosomal enzymes are made by the RER and then are transported to Golgi complex through SER. After modification, these enzymes are released from the trans face Golgi complex in the form of vesicles. Such vesicles are called lysosomes. The newly formed lysosomes before the start of their functions are usually called primary lysosomes. In plants and fungi, certain vacuoles carry out lysosomal hydrolysis, a function shared by lysosomes in animal cells. Lysosomes contain about 40 different digestive enzymes. These enzymes can digest all major macromolecules of the cell. The contents of the lysosome are acidic. Functions of Lysosomes Intracellular Digestion: The food material ingested by the cell is stored in vesicles, called food vacuoles. Once a lysosome fuses with food vacuole, the resulting structure is called secondary lysosome. The digested products are absorbed by the cytoplasm while the remaining vesicle is now called residual body. Later on the residual body fuses with cell membrane (exocytosis) to eliminate undigested wastes. This process is known as intracellular digestion. Autophagy: This is the process by which unwanted structures within the cell are engulfed and digested by lysosomes. This process is called"
  },
  {
    "chapter": "cell structure",
    "chunk_id": 16,
    "content": "autophagy. This is self-eating process of a cell in which lysosomes digest cell's own organelles. Such lysosomes are also called autophagic lysosomes. This process either takes place in starvation period in order to obtain nutrients or in routine in order to control number of specific organelle. For example, if a person used to perform heavy muscular exercise, the number of mitochondria begins to increase in muscle cells, but if he leaves exercise, the number of mitochondria are again controlled by the process of autophagy. Autolysis: This process takes place especially during developmental phase, when a particular cell is required to die. Such type of cell deaths committed, called autolysis. This is a programmed cell death. The lysosomes burst and their enzyme contents are quickly dispersed throughout the cell. In this way the cell is disintegrated into fragments which are phagocytosed by other cells. Due to this reason lysosomes are also called suicidal bags. Lysosomal Storage Diseases These diseases are caused by the genetic deficiency of one or more lysosomal enzymes. If a particular lysosomal enzyme is absent, the cell cannot digest that particular substance (for which enzyme was required). As a result, the substance begins to accumulate in the cell"
  },
  {
    "chapter": "cell structure",
    "chunk_id": 17,
    "content": "and cause disease. Such complications which are caused by the accumulation of various substances in the cell due to lack of certain lysosomal enzymes are called lysosomal storage diseases. These diseases are hereditary and congenital therefore run in particular families and appear from birth in an individual. Most of these diseases are fatal in early childhood. About 20 such diseases have been discovered so far. One of the common examples is Tay-Sachs disease in which a lipid digesting enzyme is missing or inactive and the brain function is impaired by an accumulation of lipids in the cell. Peroxisomes and Glyoxysomes Peroxisomes and glyoxysomes are collectively called microbodies. These are similar to lysosomes in the sense that both are single membranous, vesicular structures. They contain enzymes (although different than lysosome) and originate from Golgi complex but they are smaller than lysosome. Peroxisomes contain some oxidative enzymes like peroxidases, catalases and glycolic acid oxidases. They are abundant in liver cells where they are specifically involved in the oxidation and decomposition of hydrogen peroxide so they are called peroxisomes. They are mainly concerned with the detoxification of alcohol. In this process alcohol is oxidized into hydrogen peroxide (H2O2) with the help of peroxidase"
  },
  {
    "chapter": "cell structure",
    "chunk_id": 18,
    "content": "enzyme. Hydrogen peroxide is itself a toxic molecule, which is immediately broken down to water and oxygen by another enzyme called catalase. In plant cell, peroxisomes are involved in photorespiration. A step of photorespiration takes place in peroxisomes in which glycolate is converted into glycine with the help of an enzyme called glycolic acid oxidase. Glyoxysomes are found only at seedling stage in oil seed plants. These organelles contain a number of enzymes specific for plant lipid metabolism that are not found in animal cells. Germinating seedlings convert stored fatty acids to carbohydrates. This is achieved through a metabolic pathway called glyoxylate cycle, the enzymes of which are located in the glyoxysomes. Vacuoles Vacuoles are large vesicles originate from the endoplasmic reticulum and Golgi complex and plasma membrane. Vacuoles perform a variety of functions in different types of cells. In animal cells food vacuoles are formed by endocytosis. Many freshwater protists have contractile vacuoles that pump excess water out of cell, maintaining a suitable concentration. In plants, mature plant cells generally have one large central vacuole formed by joining of smaller vacuoles. The solution inside the central vacuole is the plant cell's main reservoir of inorganic ions. The central vacuole"
  },
  {
    "chapter": "cell structure",
    "chunk_id": 19,
    "content": "plays a major role in mechanical support and acts as a storehouse of the cell. The membrane separating the vacuole from cytoplasm is called tonoplast. Mitochondria Mitochondria (singular: mitochondrion) are present in all eukaryotic cells. Some cells have only one mitochondrion, but more often a cell has hundreds or even thousands. Their number correlates with the cell's level of metabolic activity. For example, active cells contract have proportionally more mitochondria per volume than less active ones. Mitochondria are capable to divide themselves (self-replicating) in order to increase their number. Mitochondria are cylindrical or rod shaped structures. They are enclosed by double membrane system i.e., outer membrane and the inner membrane. The outer membrane is smooth and contains porins. These are special proteins responsible for the transport of molecules across the membrane. Porins allow free passage of various molecules into the inter-membrane space. The inner membrane is selectively permeable and folded inwards. The folds are called cristae which serve to increase the surface area. The inner surface of cristae has granular structures called F0-F1 particles. These particles are actually ATP synthase. Other enzyme complexes are also found which function as carriers in electron transport chain. The double membrane system divides mitochondrion"
  },
  {
    "chapter": "cell structure",
    "chunk_id": 20,
    "content": "into two internal compartments. The first is narrow region between the inner and outer membrane. The second, mitochondrial matrix, is enclosed by the inner membrane. The matrix contains a small circular DNA, all kinds of RNA and prokaryotic ribosomes (70S). Mitochondria are the sites of cellular respiration, the metabolic process that uses oxygen to generate ATP by extracting energy from sugars, fats, and other organic compounds. The enzymes in the matrix catalyze some of the steps of cellular respiration like Krebs cycle. Other enzymes that function in ATP generation through electron transport chain are found in the cristae. Mitochondria display similarities with bacteria like both are self-replicating organelles, both have genetic system and metabolic machinery i.e., both has small circular DNA, all kinds of RNA and prokaryotic ribosomes (70S). An interesting fact about them is that they are capable to survive outside the cell for some time if carefully fractionated. Based upon these observations evolutionists believe that they were once free-living organism and the early ancestor of eukaryotic cells engulfed them. Eventually, the engulfed cells formed a mutually beneficial relationship with the host cell in which they were enclosed, becoming an endosymbiont (a cell living within another cell). Therefore, they"
  },
  {
    "chapter": "cell structure",
    "chunk_id": 21,
    "content": "are supposed as organisms within organism. Mitochondria divide and multiply and their number doubles before cell division. Lysosomes regulate the number of mitochondria. Excess of mitochondria are digested by lysosomes. Because mitochondria are contained within ova (egg cells) but not in heads of the sperm cells, all the mitochondria in a fertilized egg are derived from mother. Plastids Plastids are found in plant and algal cells, and they are necessary for essential life processes, like photosynthesis and food storage. On the basis of presence or absence and type of pigments, and the stage of development, plastids have been classified into proplastids, leucoplasts, chromoplasts and chloroplasts. Proplastids are young, immature and developing plastids. They are self-replicating organelles. They divide and re-divide in meristematic cells and are distributed to different cell types. Depending upon the structures in which they found, the intracellular factors and on exposure to light, they may develop into leucoplast (colorless plastids) or chloroplast (green plastids). Leucoplasts are found in parenchyma cells of root, stem and seeds. They act as storage organelles. Based on the kind of substance they store they are further classified into amyloplasts (store starch), elaioplast (store lipids) and proteinoplast (store protein). Chromoplasts synthesize different colored"
  },
  {
    "chapter": "cell structure",
    "chunk_id": 22,
    "content": "pigments other than green. Therefore, they are responsible for bright colors in parts of plant such as flower petals and fruits where they attract insects and thus help in pollination. Chloroplasts are found in green parts of the plant and act as site of photosynthesis. Structure and Functions of Chloroplast Each chloroplast is a discoid structure which consists of three parts i.e., envelope, stroma and thylakoids. Each chloroplast is bounded by a smooth double membrane (envelope). The outer membrane like mitochondria contains porins and therefore freely permeable to small molecules. The inner membrane is semipermeable and rich in protein. Between the two membranes is the intermembrane space. The stroma contains a small circular DNA. The stroma contains a system of chlorophyll-containing disc-like structures called thylakoids. Some thylakoids are stacked one upon the other like stack of coins. Each stack of thylakoids is called granum. Each granum consists of 25-50 thylakoids and there are about 40-60 grana in each chloroplast. Photosynthetic pigments are also present in thylakoids. Unstacked thylakoids connect the grana together and are called stroma thylakoids. These membranes are colorless as they do not have photosynthetic pigments. The first phase of photosynthesis is light dependent reaction in which sunlight"
  },
  {
    "chapter": "cell structure",
    "chunk_id": 23,
    "content": "is captured and transformed into ATP. This process takes place in grana region of chloroplast. The second phase of photosynthesis is light independent reaction (dark reaction) in which CO2 is reduced to carbohydrates. The enzymes for this activity are found in stroma region of chloroplast. Centrioles Centrioles are non-membranous cell organelles found mainly in animal cells. They are also present in some lower plants like algae, fungi and protists such as slime molds and water molds. Centrioles are cylindrical and usually occur in pairs. These occur at right angle to each other near the nucleus. Each centriole is composed of nine triplets of microtubules circularly arranged around a central axis. Just before the cell division, the pair of centrioles duplicates and becomes two pairs which later move to the opposite sides of the nucleus. Both centriole pairs give rise to microtubules (spindle fibers) during cell division. The whole structure of spindle fibers is known as spindle apparatus which helps in the distribution of chromosomes to the daughter cells during cell division. Cytoskeleton The cytoskeleton is a network of fibers extending throughout the cytoplasm. It provides mechanical support to the cell and maintains cell shape. It also helps to organize the"
  },
  {
    "chapter": "cell structure",
    "chunk_id": 24,
    "content": "movements of organelles. Three main types of fibers make up the cytoskeleton: microfilaments, microtubules and intermediate filaments. Microfilaments are also known as actin filaments. These are extremely thin contractile fibers. It consists of four twisted chains. They are involved in muscle contraction and relaxation. They also help in cyclosis as well. Microtubules are small hollow cylinders about 25nm in diameter and 0.2-25μm in length. They are composed of protein tubulin. Each tubulin is a dimer consisting of α-tubulin and β-tubulin. At the time of cell division the organized microtubules organize themselves to form spindle fibers. In animal cells, the microtubules are involved in the formation of centrioles, cilia, flagella and basal body. Intermediate filaments are 8 to 10 nm in diameter and intermediate in size between actin filaments and microtubules, this is why they are called intermediate filaments. The basic protein subunit of the filament is vimentin. The vimentin subunits also form chains by linear arrangement. Each intermediate filament is composed of three chains of vimentin which are twisted around each other in such a way that no hollow space is left between them. They usually form a network in the cytoplasm which provide a mechanical support to nuclear envelope"
  },
  {
    "chapter": "cell structure",
    "chunk_id": 25,
    "content": "and plasma membrane. Cilia and Flagella Cilia and flagella are hair like projections on the surface of the cells. The internal structure of both cilia and flagella is same but they may differ in length, number and pattern of movement. Generally flagella are longer, few in number, have undulating motion and beat independently. Whereas, cilia are numerous and relatively short and beat either in metachronous (cilia of a row beat one after the other) or in synchronous (all cilia of a row beat simultaneously) waves. Both cilia and flagella arise from their basal bodies embedded in the cytoplasm. Basal bodies have the same arrangement of microtubule triplets as centrioles. Movement of cilia is due to sliding of double fibrils in two groups one against the other. Five out of nine double fibrils contract simultaneously. As a result cilium bends or shortens. It is called effective stroke. Four out of nine double fibrils contract and cilium becomes straight. It is called recovery stroke. Movement of flagella: The flagellum causes movement by the passage of rapid successive waves of bending from the attached to the free end, as it can be seen in the movement of human sperms, which propel them forward"
  },
  {
    "chapter": "cell structure",
    "chunk_id": 26,
    "content": "within the fluid medium of the female reproductive tract. 1.3.3 Nucleus The nucleus is the control center of the cell. It controls cell metabolism and reproduction. It is usually the most prominent organelle in the cell. The nucleus is bounded by nuclear envelope which is a double membrane system. The nuclear envelope has nuclear pores which allow transport of materials between nucleus and cytoplasm. Nuclear Pores These are circular openings in the nuclear envelope. Each pore is surrounded by organized transport protein called nucleoporin. At each nuclear pore both the membranes are interconnected. Nuclear pores allow cytoplasmic exchange of materials. This exchange includes RNA moving from nucleus to the cytoplasm and proteins, carbohydrates, signaling molecules and lipids moving from cytoplasm to nucleus. Although smaller molecules may freely diffuse through the pores, larger molecules are recognized by specific signal sequences and diffused with the help of nucleoporin into the nucleus. Nucleoplasm Nucleoplasm is the transparent semifluid ground substance formed of a mixture of water, enzymes (DNA and RNA polymerase), free nucleotides and some metal ions (Mg) for synthesis of DNA and RNAs. It also contains histone and non-histone protein. So the nucleoplasm is slightly different from cytoplasm. Nucleolus Nucleolus is a"
  },
  {
    "chapter": "cell structure",
    "chunk_id": 27,
    "content": "non-membrane bound structure in the nucleoplasm. A cell may have one or more nucleoli. Nucleoli appear during interphase and disappear during cell division. A nucleolus consists of peripheral granular area (contains ribosomes) and a central fibrillar area (contains rRNA and rDNA). Therefore, nucleolus is concerned with the construction of ribosomes. Chromatin and Chromosomes Chromatin is a network of thin thread-like structures made up of DNA and proteins. During cell division chromatin fibers begin to condense and coil up into distinct chromosomes. The centromere is a constriction functionally related to the movement of chromosomes during cell division. Each centromere has a complex of proteins called kinetochores present on the opposite sides of the constriction. Each kinetochore forms the site of attachment for a single microtubule during cell division. Some chromosomes may have another point of constriction along the length of chromatids, called secondary constriction or nucleolar organizer. It gives rise to nucleoli during interphase. 1.4 PROKARYOTIC VS EUKARYOTIC CELLS Two kinds of structurally different cells have evolved over time. Prokaryotic cells include archaea, bacteria and cyanobacteria whereas all other forms of life are composed of eukaryotic cells. A prokary"
  }
]